---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementIntersectsSolidFilter
source: html/939e9c37-4faf-8261-94d3-e6625bdcd3cb.htm
---
# ElementIntersectsSolidFilter Members

Constructs a filter to match elements which intersect the given element.